Revit 2024 API
ExternalDataInstanceRemovingFromDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceRemovingFrom event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ExternalDataInstanceRemovingFromDocumentEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class ExternalDataInstanceRemovingFromDocumentEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class ExternalDataInstanceRemovingFromDocumentEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
See Also
ExternalDataInstanceRemovingFromDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace